import time

from game.client import Client
from settings import *

from itertools import cycle, chain


commands = [
    '2:0', # сброс
    '2:1', # заведение команды
    '2:Alex Means',
    '2:Рома 3 Копейки',
    '2:Никич',
    '2:Ali G',
    '2:1', # заведение команды
    '2:Ираклий Кудрявый',
    '2:Куртка Бейн',
    '2:Alfonso',
    '2:Bad Santa',
    '2:1', # заведение команды//завершение
    '2:2', # команда 1 >
    '2:3', # команда 1 <
    '2:4', # команда 1 ^
    '2:5', # команда 1 ⌄
    '2:6', # команда 2 >
    '2:7', # команда 2 <
    '2:8', # команда 2 ^
    '2:9', # команда 2 ⌄
]


teams = [
    '2:1',
    '2:Alex Means',
    '2:Рома 3 Копейки',
    '2:Никич',
    '2:Ali G',
    '2:1',
    '2:Ираклий Куда',
    '2:Куртка Бейн',
    '2:Alfonso',
    '2:Bad Santa',
    '2:1',
]

first_move_set = [
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:2', # команда 1 >
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:4', # команда 1 ^
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:5', # команда 1 ⌄
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
    '2:3', # команда 1 <
]
second_move_set = [
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:9', # команда 2 ⌄
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:6', # команда 2 >
    '2:8', # команда 2 ^
    '2:8', # команда 2 ^
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
    '2:7', # команда 2 <
]

move_sets = list(zip(first_move_set, second_move_set))

network = Client(UNIX_HOST, PACKAGE_SIZE)

for i in teams:
    network.send(i)

    time.sleep(0.1)

for i in cycle(move_sets):
    resp1 = network.send(i[0])
    resp2 = network.send(i[1])

    if '1:finish' in resp1 or '1:finish' in resp2:
        break

    time.sleep(0.1)
